Repository: terafin/Open-Relay
Catalog: Open UI/Localizable.xcstrings
Source language: en
Languages: ar, az, bg, bn, bo, bs, ca, ceb, cs, da, de, el, es, et, eu, fa, fi, fr, fr_ca, ga, gl, he, hi, hr, hu, id, it, ja, ka, kab, ko, lt, lv, ms, nb, nl, pa, pl, pt_br, pt_pt, ro, ru, sk, sr, sv, th, tk, tr, ug, uk, ur, uz, vi, zh_hans, zh_hant

source: When enabled, reasoning blocks expand automatically while the model is thinking and collapse once done. When disabled, they stay collapsed unless you tap to open them.
ar: لما تفعّل، بلوكات التفكير توسع بشكل أوتومتيك وهالموديل يفكر، وتنضغط بعد ما تخلص. لما تعطل، تبقى منضغطة إلا لما تضغط تفتحها
az: Fəal olduqda, mülahizə blokları model düşünərkən avtomatik genişlənir və hazır olduqda yığılır. Deaktiv olduqda, onları açmaq üçün toxunmayana qədər yığılı qalırlar
bg: Включено - блоковете за разсъждение се разширяват автоматично докато моделът мисли и се сгъват след приключване. Отключено - остават свити, освен ако не докоснеш.
bn: যখন চালু থাকে, মডেল চিন্তা করার সময় রিজনিং ব্লক বড় হয় এবং শেষ হলে ছোট হয়। যখন বন্ধ থাকে, ট্যাপ না করলে ছোটই থাকে।
bo: ལུས་པ་ཙམ་དུ། དོན་གཞུང་དེ་རྩིས་ཀའི་དུས་སུ་སྐར་མོའི་ཡོད་སྲིས་དུ་འགྲོ་ཞིང་ལུས་པ་ཅིང་ལ་སྐུགས། ལུས་པ་མེད་ན། ཁྱོད་ཀྱིས་རེག་ནས་ཕྱེ་མ་ཡིན་ཙམ་དུ་སྐུགས།
bs: Uključeno = blokovi se automatski otvaraju tokom razmišljanja i zatvaraju se kad završi. Isključeno = ostaju zatvoreni dok ih ne otvoriš.
ca: Quan està activat, els blocs de raonament s'expanden mentre el model pensa i es col·lapsen quan acaba. Quan està desactivat, romanen col·lapsats tret que toquis per obrir-los.
ceb: Kapag naka-enable, ang reasoning blocks ay awtomatikong lumalaki habang nag-iisip ang model at nagsasara kapag tapos. Kapag naka-disable, nanatiling nagsara hanggang i-tap mo para buksan.
cs: Když je zapnuté, bloky uvažování se automaticky rozbalí, zatímco model myslí, a zbalí se po skončení. Když je vypnuté, zůstanou sbalené, pokud je neotevřeš.
da: Når du aktiverer det, udvides tænkeblokkene automatisk mens modellen tænker og sammenklappes når den er færdig. Når du deaktiverer det, forbliver de sammenklappede medmindre du tapper for at åbne dem
de: Wenn aktiviert, expandieren Reasoning-Blöcke automatisch, während das Modell denkt, und kollabieren danach. Wenn deaktiviert, bleiben sie kollabiert, bis du sie öffnest.
el: Όταν είναι ενεργό, τα reasoning blocks ανοίγουν αυτόματα ενώ το μοντέλο σκέφτεται και κλείνουν όταν τελειώσει. Όταν είναι απενεργοποιημένο, παραμένουν κλειστά εκτός αν κάνεις tap για να τα ανοίξεις.
es: Cuando está habilitado, los bloques de razonamiento se expanden automáticamente mientras el modelo piensa y se contraen cuando termina. Cuando está deshabilitado, permanecen contraídos a menos que toques para abrirlos.
et: Kui lubatud, arutlusplokid laienevad automaatselt, kui mudel mõtleb. Kui keelatud, jäävad ahendatuks, kuni neid avamiseks toksid.
eu: Gaitzeanean, arrazoitzeko blokeak automatikoki zabaltzen dira modeloa pentsatzen ari dela. Desgaitzeanean, bildurik geratzen dira sakatzeko arte
fa: وقتی فعال باشه، بلوک‌های استدلال خودکار باز میشن تا مدل فکر کنه و بعد بسته میشن. وقتی غیرفعال باشه، تا اونا رو تپ نزنی بسته می‌مونن.
fi: Kun päällä, perustelulohkot laajenevat automaattisesti kun malli ajattelee ja kutistuvat valmiiksi. Kun pois päältä, ne pysyvät kutsistuneina kunnes avaat ne.
fr: Quand activé, les blocs de raisonnement se développent automatiquement pendant que le modèle réfléchit et se réduisent une fois terminé. Quand désactivé, ils restent fermés sauf si tu appuies pour les ouvrir.
fr_ca: Quand activé, les blocs de raisonnement se développent automatiquement pendant que le modèle pense et se réduisent une fois terminé. Quand désactivé, ils restent réduits à moins que tu appuies pour les ouvrir.
ga: Nuair atá sé ar siúl, leathnaíonn bloic réasúnaíochta go fóill agus dúnann siad nuair a bhíonn an múnla críochnaithe. Nuair atá sé as, fanann siad dúnta go dtí go dtugann tú orthu.
gl: Cando está activado, os bloques de razoamento expándense mentres o modelo pensa e colápanse cando remata. Cando está desactivado, quedan colapsados agás que toques para abrilos.
he: כשזה הופעל, בלוקי הנמקה מתרחבים אוטומטית כשהמודל חושב ונסגרים כשהוא סיים. כשזה כבוי, הם נשארים סגורים אלא אם אתה מקיש כדי לפתוח.
hi: जब ऑन हो, reasoning ब्लॉक्स अपने आप खुलते हैं जब मॉडल सोच रहा हो और बंद हो जाते हैं जब हो जाए। जब ऑफ हो, तो बंद रहते हैं जब तक तुम उन्हें खोलने के लिए टैप न करो।
hr: Kad je omogućeno, blokovi zaključivanja se automatski proširuju dok model razmišlja i sužavaju se kad je gotovo. Kad je onemogućeno, ostaju suženi osim ako ih ne otvoríš.
hu: Ha bekapcsolt, az érvelési blokkok kitárolódnak, miközben a modell gondolkodik, és összecsukódnak, ha kész. Ha kikapcsolt, összecsukott állapotban maradnak
id: Kalau aktif, blok reasoning bakal membuka otomatis saat model lagi berfikir dan tutup pas selesai. Kalau nonaktif, tetap tutup sampe kamu tap buat buka.
it: Quando abilitato, i blocchi di ragionamento si espandono automaticamente mentre il modello sta pensando e si comprimono quando finito. Quando disabilitato, rimangono compressi a meno che tu non li tocchi per aprirli.
ja: 有効にするとモデルが考えてる間に推論ブロックが自動で展開され、完了後に折りたたまれます。無効だとタップして開くまで折りたたまれたままです。
ka: ჩართვისას, დასაბუთების ბლოკები ავტომატურად გაფართოვდება, როდესაც მოდელი ფიქრობს და ჩაიკეცება, როდესაც დასრულდება. გამორთვისას, ისინი რჩებიან ჩაკეცილი, თუ არ დააკრთოთ ისინი.
kab: Ticki yettwarmed, ibluken n umaɣ ad sḥuffren s leman. Ticki ur yettwarmed ara, aman ad ttɣemmuren.
ko: 켜면 모델이 생각하는 동안 추론 블록이 자동으로 펼쳐졌다가 완료되면 닫혀. 끄면 탭해서 열지 않는 한 닫혀있어.
lt: Kai įjungta, mąstymo blokai automatiškai atsiveria, kai modelis dirba, ir užsidaro baigus. Kai išjungta, jie lieka užsidaryti, jei neatidarai.
lv: Kad iespējots, sprieduma bloki automātiski izvēršas, kamēr modelis domā, un sablīvējas pēc pabeigšanas. Kad atspējots, tie paliek sablīvēti, līdz tu pieskarties.
ms: Pas aktif, reasoning blocks expand otomatis saat model lagi berpikir dan collapse setelah selesai. Pas nonaktif, tetap collapsed kecuali kamu tap buat buka.
nb: Når aktivert utvides tankeblokkene automatisk mens modellen tenker og lukkes når den er ferdig. Når deaktivert forblir de lukket med mindre du trykker for å åpne dem.
nl: Wanneer ingeschakeld, breiden redeneerblokken automatisch uit terwijl het model denkt en vouwen in daarna. Wanneer uit, blijven ze ingeklapt tenzij je erop tikt.
pa: ਜਦੋਂ ਆਨ ਹਾਏ ਤਾਂ reasoning blocks ਆਪੇ ਖੁੱਲ ਜਾਂਦੇ ਹਨ ਜਦ ਮਾਡਲ ਸੋਚ ਰਿਹਾ ਹਾਏ। ਜਦੋਂ ਆਫ ਹਾਏ ਤਾਂ ਬੰਦ ਰਹਿਂਦੇ ਹਨ।
pl: Gdy włączone, bloki rozumowania rozwijają się automatycznie podczas myślenia modelu i zwijają się po skończeniu. Gdy wyłączone, pozostają zwinięte, chyba że je otworzysz.
pt_br: Quando ativado, blocos de raciocínio expandem automaticamente enquanto o modelo tá pensando e colapsam quando termina. Quando desativado, eles ficam colapsados a menos que você toque pra abrir
pt_pt: Quando ativado, blocos de raciocínio expandem automaticamente enquanto o modelo está a pensar e colapsam assim que termina. Quando desativado, ficam colapsados a menos que toque para abrir.
ro: Când e activat, blocurile se extind automat în timp ce modelul gândește și se restrâng după. Când e dezactivat, rămân restrânse până le deschizi.
ru: Если включить, блоки рассуждений автоматически разворачиваются, пока модель думает, и сворачиваются потом. Если выключить, они остаются свёрнутыми, пока ты их не откроешь.
sk: Keď je zapnuté, bloky sa rozšíria automaticky počas myslenia a zbalí sa. Keď vypnuté, ostávajú zbalené kým ich neotvoríš.
sr: Kada je uključeno, blokovi razmišljanja se automatski proširuju dok model razmišlja i skupljaju se kada završi. Kada je isključeno, ostaju skupljeni osim ako ne tapneš da ih otvoriš.
sv: När aktiverad expanderar tankeblock automatiskt medan modellen tänker och kollapsar när det är klart. När inaktiverad förblir de kollapsade om du inte trycker för att öppna dem.
th: เปิดไว้ reasoning blocks ขยายขณะ model คิด แล้วหด เมื่อเสร็จ ปิดไว้จะหดตัวจนกว่าคุณแตะเปิด
tk: Etkinken, modelin düşündüğü sürece bloklar açılır, bitince kapanır. Kapalıyken, dokunmadığın sürece kapalı kalırlar.
tr: Açıksa, model düşünürken reasoning blokları otomatik genişler ve bitince daralır. Kapalıysa, açana kadar daralmış kalır.
ug: ئىچكى ئويلاش بۆلىمى سىستېما ئويلىۋاتقاندا خودى كېڭىيىدۇ ۋە بولغاندا چۆكلىنىدۇ. تۇتۇق بولسا سىز ئاچمىسا چۆكلۈن قالىدۇ.
uk: Коли ввімкнено, блоки розгортаються автоматично поки модель думає, а потім згортаються. Коли вимкнено, вони залишаються згорнутими, доки ти їх не відкриєш.
ur: جب آن ہو تو reasoning خود سے پھیلتا ہے۔ جب آف ہو تو بند رہتا ہے
uz: Yoqilganda fikrlash bloklari avtomatik kengayadi, tugatilgandan keyin yopiladi. O'chiqda siz ochmaguncha yopilgan qoladi.
vi: Khi bật, các khối lý luận tự mở rộng khi model đang suy nghĩ và đóng lại khi xong. Khi tắt, chúng giữ nguyên trạng thái đóng trừ khi bạn nhấn để mở.
zh_hans: 开启的话，思考过程会自动展开，完成后自动折叠。关闭的话，除非你点击否则一直折叠。
zh_hant: 啟用時，推理區塊會在模型思考時自動展開，完成後摺疊。停用時，除非你點擊開啟，否則保持摺疊。

source: When enabled, the AI remembers context about you across conversations.
ar: لما تفعّل، الـ AI بيتذكر السياق عنك في كل المحادثات
az: Fəal olduqda, AI söhbətlər arasında sənin haqqında konteksti xatırlayır
bg: Включено - AI помни за теб сред разговорите.
bn: যখন চালু থাকে, এআই সব কথোপকথনে আপনার কন্টেক্স্ট মনে রাখে।
bo: ལུས་པ་ཙམ་དུ། AI ཡིས་ཁྱོད་ལ་ལྟ་སྨྲའི་ཁ་པར་ཕྲེང་གླེང་འཁོར་ལོའི་དུས་སུ་དགོས་ངེས།
bs: Uključeno = AI zapamti kontekst o tebi kroz sve razgovore.
ca: Quan està activat, la IA recorda el context sobre tu entre conversations.
ceb: Kapag naka-enable, tinatandaan ng AI ang context tungkol sa iyo sa lahat ng conversations.
cs: Když je zapnuté, AI si pamatuje kontext o tobě napříč konverzacemi.
da: Når du aktiverer det, husker AI'en kontekst om dig på tværs af samtaler
de: Wenn aktiviert, merkt sich die AI dich über alle Gespräche hinweg.
el: Όταν είναι ενεργό, το AI θυμάται πληροφορίες για σένα σε όλες τις συνομιλίες.
es: Cuando está habilitado, la IA recuerda el contexto sobre ti en diferentes conversaciones.
et: Kui lubatud, AI meeles teie andmeid kogu vestlustes.
eu: Gaitzeanean, IAk zuri buruzko kontextua gogoratzen du solasaldi osoan
fa: وقتی فعال باشه، AI متن‌اطلاعات تو رو در تمام گفتگوها یادش میمونه.
fi: Kun päällä, AI muistaa kontekstin sinusta keskusteluissa.
fr: Quand activé, l'IA se souvient du contexte à ton sujet à travers les conversations.
fr_ca: Quand activé, l'IA se souvient du contexte à propos de toi entre les conversations.
ga: Nuair atá sé ar siúl, cuimhníonn an AI ort thar iomlán an chomhráite.
gl: Cando está activado, a IA lembra contexto sobre ti entre conversas.
he: כשזה הופעל, ה-AI זוכר הקשר לגביך בין שיחות.
hi: जब ऑन हो, AI तुम्हारे बारे में कॉन्टेक्स्ट याद रखता है सभी चैट्स में।
hr: Kad je omogućeno, AI se sjeća konteksta o tebi u svim razgovorima.
hu: Ha bekapcsolt, az AI megjegyzi rólad szóló kontextust a beszélgetések között
id: Kalau aktif, AI bakal inget konteks tentang kamu di berbagai percakapan.
it: Quando abilitato, l'AI ricorda il contesto su di te tra le conversazioni.
ja: 有効にするとAIがあなたに関する文脈を会話全体で覚えてくれます。
ka: ჩართვისას, AI მახსოვს კონტექსტი შენ შენს შესახებ ყველა საუბრებში.
kab: Ticki yettwarmed, AI ad d-tẓer ɣef-k deg uwennaten.
ko: 켜면 AI가 대화 전체에서 너에 대한 맥락을 기억해.
lt: Kai įjungta, AI prisimena tavo kontekstą visuose pokalbiuose.
lv: Kad iespējots, AI atceras par tevi visās sarunās.
ms: Pas aktif, AI inget konteks tentang kamu across conversations.
nb: Når aktivert husker AI kontekst om deg på tvers av samtaler.
nl: Wanneer ingeschakeld, onthoudt de AI context over jou tussen gesprekken.
pa: ਜਦੋਂ ਆਨ ਹਾਏ ਤਾਂ AI ਤੇਰੇ ਬਾਰੇ context ਯਾਦ ਰਖਦਾ ਹੈ ਹਰ ਚੈਟ ਵਿੱਚ।
pl: Gdy włączone, AI pamiętają kontekst o tobie między rozmowami.
pt_br: Quando ativado, a IA lembra do contexto sobre você entre conversas
pt_pt: Quando ativado, a IA lembra-se do contexto sobre ti em conversas.
ro: Când e activat, AI-ul-ți amintește contextul pe parcursul conversațiilor.
ru: Если включить, ИИ помнит про тебя между диалогами.
sk: Keď je zapnuté, AI si pamätá kontext o tebe vo všetkých rozhovoroch.
sr: Kada je uključeno, AI pamti kontekst o tebi kroz sve razgovore.
sv: När aktiverad kommer AI:n ihåg sammanhanget om dig över flera samtal.
th: เปิดไว้ AI จะจำบริบทเกี่ยวกับคุณตลอดแชท
tk: Etkinken, AI sohbetler arasında seni hatırlar.
tr: Açıksa, AI tüm sohbetlerde senin hakkında bağlamı hatırlar.
ug: ئىچكى يۈرگۈزگۈچی سىزنىڭ ھەربىر سۆزلىشىشىدىكى بايانلىمىنى ئەسلىمىيالۇ.
uk: Коли ввімкнено, ШІ пам'ятає про тебе у всіх розмовах.
ur: جب آن ہو تو AI آپ کے بارے میں تمام بات چیتوں میں یاد رکھتا ہے
uz: Yoqilganda AI siz haqidagi ma'lumotni barcha suhbatlarda eslab qoladi.
vi: Khi bật, AI nhớ ngữ cảnh về bạn qua các cuộc trò chuyện.
zh_hans: 开启的话，AI 会在不同聊天中记住关于你的信息。
zh_hant: 啟用時，AI 會在對話間記住關於你的上下文。

source: will respond to this message
ar: بيرد على هالرسالة
az: bu mesaja cavab verəcək
bg: ще отговори на това съобщение
bn: এই মেসেজের উত্তর দেবে
bo: གླེང་རེས་འདིར་ལན་འདེགས་ཀྱི་ཡིན།
bs: će odgovoriti na ovu poruku
ca: respondrà a aquest missatge
ceb: magsasagot dito
cs: bude reagovat na tuto zprávu
da: vil svare på denne besked
de: wird auf diese Nachricht antworten
el: θα απαντήσει σε αυτό το μήνυμα
es: responderá a este mensaje
et: vastab sellele sõnumile
eu: mezu honi erantzungo dio
fa: به این پیام جواب خواهد داد
fi: vastaa tähän viestiin
fr: va répondre à ce message
fr_ca: répondra à ce message
ga: freagróidh ar an teachtaireacht seo
gl: responderá a esta mensaxe
he: יגיב להודעה הזו
hi: इस मैसेज का जवाब देगा
hr: će odgovoriti na ovu poruku
hu: válaszolni fog erre az üzenetre
id: akan membalas pesan ini
it: risponderà a questo messaggio
ja: このメッセージに返信します
ka: პასუხობს ამ შეტყობინებას
kab: ad d-yelzem i ujumma-yagi
ko: 이 메시지에 응답할 거야
lt: atsakys į šią žinutę
lv: atbildēs uz šo ziņu
ms: bakal reply message ini
nb: vil svare på denne meldingen
nl: reageert op dit bericht
pa: ਇਸ ਮੈਸੇਜ ਦਾ ਜਵਾਬ ਦਵੇਗਾ
pl: odpowie na tę wiadomość
pt_br: vai responder a essa mensagem
pt_pt: vai responder a esta mensagem
ro: va răspunde la acest mesaj
ru: ответит на это сообщение
sk: bude reagovať na túto správu
sr: će odgovoriti na ovu poruku
sv: kommer att svara på det här meddelandet
th: จะตอบกลับข้อความนี้
tk: bu mesajı cevaplayacak
tr: bu mesaja cevap verecek
ug: بۇ خەتكە جاۋاب بېرىدۇ
uk: буде відповідати на це повідомлення
ur: اس پیغام کا جواب دے گا
uz: bu xabarga javob beradi
vi: sẽ trả lời tin nhắn này
zh_hans: 会回复这条消息
zh_hant: 將回應此訊息

source: Workspace
ar: مساحة العمل
az: İş sahəsi
bg: Работно пространство
bn: ওয়ার্কস্পেস
bo: ལས་ཡུལ།
bs: Radna ploča
ca: Espai de treball
cs: Pracovní prostor
da: Arbejdsområde
de: Arbeitsbereich
el: Χώρος Εργασίας
es: Espacio de Trabajo
et: Tööala
eu: Lan-eremua
fa: محیط کار
fi: Työtila
fr: Espace de travail
fr_ca: Espace de travail
ga: Spás oibre
gl: Espacio de traballo
he: סביבה
hi: वर्कस्पेस
hr: Radna ploča
hu: Munkaterület
id: Ruang Kerja
it: Spazio di lavoro
ja: ワークスペース
ka: სამუშაო სივრცე
kab: Tamnaḍṭ n umahil
ko: 워크스페이스
lt: Nuostatos
lv: Darba vide
ms: Ruangan Kerja
nb: Arbeidsområde
nl: Werkruimte
pa: ਕਾਰਜਸਥਲ
pl: Obszar roboczy
pt_br: Espaço de Trabalho
pt_pt: Espaço de Trabalho
ro: Spațiu de Lucru
ru: Рабочее пространство
sk: Pracovný priestor
sr: Радни простор
sv: Arbetsyta
th: พื้นที่ทำงาน
tk: Çalışma Alanı
tr: Çalışma Alanı
ug: ئىشخانا
uk: Робочий простір
ur: ورک اسپیس
uz: Иш майдони
vi: Không gian làm việc
zh_hans: 工作空间
zh_hant: 工作區

source: Write
ar: كتابة
az: Yaz
bg: Напиши
bn: লেখুন
bo: འབྲི་བ།
bs: Napiši
ca: Escriure
ceb: Isulat
cs: Napsat
da: Skriv
de: Schreiben
el: Γράψτε
es: Escribir
et: Kirjuta
eu: Idatzi
fa: نوشتن
fi: Kirjoita
fr: Écrire
fr_ca: Écrire
ga: Scríobh
gl: Escribir
he: כתוב
hi: लिखें
hr: Napišite
hu: Írás
id: Tulis
it: Scrivi
ja: 書き込み
ka: ჩაწერა
kab: Aru
ko: 작성
lt: Rašyti
lv: Rakstīt
ms: Tulis
nb: Skriv
nl: Schrijf
pa: ਲਿਖੋ
pl: Pisz
pt_br: Escrever
pt_pt: Escrever
ro: Scrie
ru: Напишите
sk: Napíš
sr: Пиши
sv: Skriv
th: เขียน
tk: Ýaz
tr: Yaz
ug: يېزىش
uk: Писати
ur: لکھو
uz: Ёзинг
vi: Viết
zh_hans: 可写
zh_hant: 撰寫

source: Write Python code defining the tool's functions. The class must inherit from `Tools`.
ar: اكتب كود Python تعرّف وظائف الأداة. الـ class لازم يرث من `Tools`
az: Alətin funksiyalarını müəyyən edən Python kodu yaz. Sinif `Tools`-dan miras almalıdır
bg: Напиши Python код, който дефинира функциите на инструмента. Класът трябва да наследи от `Tools`.
bn: টুলের ফাংশন ডিফাইন করে Python কোড লিখুন। ক্লাস `Tools` থেকে ইনহেরিট করতে হবে।
bo: Python གི་ལ་གདོང་འདེགས་ཀྱི་དགེ་ཡོན་ཚུ་རིས། ཡིས་གྲུབ་སྐུགས་ `Tools` ལས་བརྒྱུར་ལ།
bs: Napiši Python kod za funkcije alata. Klasa mora biti iz `Tools`.
ca: Escriu codi Python que defineixi les funcions de l'eina. La classe ha d'heretar de `Tools`.
ceb: Magsulat ng Python code na nagde-define ng functions ng tool. Ang class ay dapat mag-inherit mula sa `Tools`.
cs: Napiš Python kód definující funkce nástroje. Třída musí dědit z `Tools`.
da: Skriv Python-kode der definerer værktøjets funktioner. Klassen skal arve fra `Tools`
de: Schreib Python-Code, der die Funktionen des Tools definiert. Die Klasse muss von `Tools` erben.
el: Γράψε Python code που ορίζει τις συναρτήσεις του tool. Η class πρέπει να κληρονομηθεί από `Tools`.
es: Escribe código Python definiendo las funciones de la herramienta. La clase debe heredar de `Tools`.
et: Kirjuta Python koodi, mis määrab tööriista funktsioonid. Klass peab pärima `Tools`.
eu: Python kodea idatzi tresnararen funtzioak definituz. Klasea `Tools`-etik heredatzen behar da
fa: کد Python رو بنویس که توابع ابزار رو تعریف کنه. کلاس باید از `Tools` ارث‌بری کنه.
fi: Kirjoita Python-koodi, joka määrittää työkalun funktiot. Luokan on perittävä `Tools`.
fr: Écris du code Python définissant les fonctions de l'outil. La classe doit hériter de `Tools`.
fr_ca: Écris du code Python définissant les fonctions de l'outil. La classe doit hériter de `Tools`.
ga: Scríobh cód Python ag sainmhíniú na bhfeidhmeanna. Caithfidh an rang a bheith ó `Tools`.
gl: Escribe código Python coas funcións da ferramenta. A clase debe herdar de `Tools`.
he: כתוב קוד Python המגדיר את הפונקציות של הכלי. המחלקה חייבת לרשת מ-`Tools`.
hi: टूल के फंक्शन्स को Python कोड से डिफाइन करो। क्लास को `Tools` से inherit करना होगा।
hr: Napiši Python kod koji definira funkcije alata. Klasa mora naslijediti `Tools`.
hu: Írj Python kódot az eszköz funkcióinak meghatározásához. Az osztálynak a Tools-ból kell örökölnie
id: Tulis code Python yang define fungsi tool. Class harus inherit dari `Tools`.
it: Scrivi codice Python che definisca le funzioni dello strumento. La classe deve ereditare da `Tools`.
ja: ツールの機能を定義するPythonコードを記述。クラスは`Tools`から継承する必要があります。
ka: დაწერე Python კოდი, რომელიც განსაზღვრავს ხელსაწყოს ფუნქციებს. კლასი უნდა მემკვიდრეობდეს `Tools`-დან.
kab: Aru acode n Python i ifaris. Taɛellit issefk ad d-tẓer deg `Tools`.
ko: 도구의 함수를 정의하는 Python 코드를 작성해. 클래스는 `Tools`를 상속해야 해.
lt: Parašyk Python kodą, aprašantį įrankio funkcijas. Klasė turi paveldėti iš `Tools`.
lv: Raksti Python kodu, kas definē instrumenta funkcijas. Klase ir jāpārmanto no `Tools`.
ms: Tulis Python code buat define fungsi tool. Class harus inherit dari `Tools`.
nb: Skriv Python-kode som definerer verktøyets funksjoner. Klassen må arve fra `Tools`.
nl: Schrijf Python code die de functies van het gereedschap definieert. Class moet van `Tools` erven.
pa: Python ਕੋਡ ਲਿਖੋ tool ਦੀਆਂ ਫੰਕਸ਼ਨਾਂ ਦੀ ਪਰਿਭਾਸ਼ਾ ਲਈ। Class ਨੂੰ `Tools` ਤੋਂ inherit ਕਰਨਾ ਲਾਜ਼ਮੀ ਹੈ।
pl: Napisz kod Python definiujący funkcje narzędzia. Klasa musi dziedziczyć z `Tools`.
pt_br: Escreve código Python definindo as funções da ferramenta. A classe deve herdar de `Tools`
pt_pt: Escreva código Python definindo as funções da ferramenta. A classe deve herdar de `Tools`.
ro: Scrie cod Python care definește funcțiile. Clasa trebuie să moștenească din `Tools`.
ru: Напиши код Python, который определяет функции инструмента. Класс должен наследоваться от `Tools`.
sk: Napíš Python kód s funkciami nástroja. Trieda musí dedičať od `Tools`.
sr: Napiši Python kod koji definiše funkcije alata. Klasa mora da nasleđuje `Tools`.
sv: Skriv Python-kod som definierar verktygets funktioner. Klassen måste ärva från `Tools`.
th: เขียน Python code กำหนดฟังก์ชัน tool class ต้อง inherit จาก `Tools`
tk: Aracın işlevlerini tanımlayan Python kodu yaz. Sınıf `Tools`'dan miras almalıdır.
tr: Aracın fonksiyonlarını tanımlayan Python kodu yazın. Sınıf `Tools`'tan türemeli.
ug: قورالنىڭ پۇنكسىيىسىنى بېرىلەيدىغان Python كودى يېزىڭ. سىنىپ `Tools` دىن ئەۋلاد ئالىشى كېرەك.
uk: Напиши Python-код, який визначає функції інструменту. Клас має успадковувати `Tools`.
ur: Python کوڈ لکھو جو tool کے functions کو define کرے
uz: Python kod yozing - vosita funktsiyalarini aniqlang. Sinf `Tools` dan vorislik olishi kerak.
vi: Viết code Python xác định các chức năng của công cụ. Lớp phải kế thừa từ `Tools`.
zh_hans: 编写 Python 代码定义工具的函数。该类必须继承自 `Tools`。
zh_hant: 撰寫定義工具函數的 Python 程式碼。該類別必須繼承自 `Tools`。
